# read design
read_verilog rtl/debounce.v
read_verilog rtl/i2c_slave_axil_master.v
read_verilog rtl/i2c_slave.v
read_verilog rtl/main_fsm.v
read_verilog rtl/mcp4812.v
read_verilog rtl/ram_256k.v
read_verilog rtl/spi_slave.v
read_verilog rtl/top.v
# hierarchy -top top

synth_ice40 -top top -blif out.blif
